{
  "Talents": {
    "Smite Evil": {
      "Type": "Default",
      "Base": "You can use this talent once per battle, plus an additional number of times per day equal to your Charisma modifier. As a free action before you make a paladin melee attack roll, you can declare that you’re using a Smite Evil attack. Add +1d12 to the damage roll AND deal half damage with the attack if it misses.",
      "Adventurer": "Your Smite Evil attacks gain a +4 attack bonus.",
      "Champion": "Add 2d12 to the damage roll instead of 1d12.",
      "Epic": "Add 4d12 to the damage roll instead of 2d12."
    },
    "Bastion": {
      "Type": "Optional",
      "Base": "You gain +1 AC. In addition, once per battle when a nearby ally is hit by an attack, you can choose to lose hit points equal to half of that damage, and have your ally take only half of the damage instead. The damage you lose can come from temporary hit points, but isn’t affected by damage resistance and other tricks to avoid the damage.",
      "Adventurer": "Increase your total number of recoveries by 1.",
      "Champion": "Once per day, you can use Bastion twice in the same battle.",
      "Epic": "When you use Bastion now, your ally takes no damage. You still lose hit points equal to half the damage."
    },
    "Cleric Training": {
      "Type": "Optional",
      "Base": "Choose one cleric spell of your level or lower. That spell is now part of your powers. (You can change out the spell normally.)",
      "Adventurer": "You can use your Charisma as the attack ability for cleric spells you can cast.",
      "Champion": "You can now cast the cleric class feature heal spell twice per day.",
      "Epic": "Choose two cleric spells instead of one."
    },
    "Divine Domain (A)": {
      "Type": "Optional",
      "Base": "Choose one of the domains listed in the cleric’s class talent list. You gain all the domain’s advantages, including the ability to use the domain’s invocation once per day. If the domain you choose is designed to help cleric spells and attacks, reinterpret the talent to help your paladin powers. You can use the domain’s feats if you wish; reinterpret them similarly if necessary.",
      "Special": "You can choose Divine Domain a second time, if you wish, at 5th level or at 8th level."
    },
    "Divine Domain (C)": {
      "Type": "Optional",
      "Base": "Choose one of the domains listed in the cleric’s class talent list. You gain all the domain’s advantages, including the ability to use the domain’s invocation once per day. If the domain you choose is designed to help cleric spells and attacks, reinterpret the talent to help your paladin powers. You can use the domain’s feats if you wish; reinterpret them similarly if necessary.",
      "Special": "You can choose Divine Domain a second time, if you wish, at 5th level or at 8th level."
    },
    "Divine Domain (E)": {
      "Type": "Optional",
      "Base": "Choose one of the domains listed in the cleric’s class talent list. You gain all the domain’s advantages, including the ability to use the domain’s invocation once per day. If the domain you choose is designed to help cleric spells and attacks, reinterpret the talent to help your paladin powers. You can use the domain’s feats if you wish; reinterpret them similarly if necessary.",
      "Special": "You can choose Divine Domain a second time, if you wish, at 5th level or at 8th level."
    },
    "Fearless": {
      "Type": "Optional",
      "Base": "You are immune to fear abilities and to any non-damage effects of attacks named or described as fear attacks. In addition, you gain a +1 melee attack bonus against enemies that are not engaged by any of your allies. The bonus increases to +2 against enemies with fear abilities.",
      "Adventurer": "You gain a +1 bonus to death saves.",
      "Champion": "You gain a +1 bonus to all saves except death saves.",
      "Epic": "Your nearby allies gain a +1 bonus to death saves."
    },
    "Implacable": {
      "Type": "Optional",
      "Base": "You can roll saves at the start of your turn instead of at the end of your turn. A successful save against ongoing damage, for example, means that you will not take the ongoing damage that turn.",
      "Adventurer": "You gain a +1 bonus to saves.",
      "Champion": "Once during your turn as a free action, you can choose to lose hit points equal to your level to reroll a save.",
      "Epic": "You gain a +1 bonus to Physical Defense and Mental Defense."
    },
    "Lay on Hands": {
      "Type": "Optional",
      "Base": "Twice per day as a quick action, you can heal yourself or an ally next to you with a touch. You spend the recovery while the recipient heals as if they had spent the recovery.",
      "Adventurer": "Add twice your Charisma modifier to the healing provided by Lay on Hands.",
      "Champion": "Lay on Hands healing uses a free recovery instead of one of your own.",
      "Epic": "You can now use Lay on Hands four times per day instead of two."
    },
    "Paladin’s Challenge": {
      "Type": "Optional",
      "Base": "When you hit an enemy with a melee attack, you can choose to challenge that enemy as a free action. Until the end of the battle, provided that both you and the enemy you’ve challenged are conscious and capable of making an attack, you each take a –4 attack penalty against all other creatures and a –4 penalty to disengage checks from each other.\n\nThe attack penalty temporarily deactivates for the attacker when they make an attack roll against their rival, but only until the end of the attacker’s turn. For example, if a creature with more than one attack attacks you first, its subsequent attacks against your allies are without the challenge penalty. However, the attack penalty resets at the end of its turn, so it does not help with opportunity attacks against your allies later in the round.\n\nYou can only have one enemy challenged at a time.\n\nYour Paladin’s Challenge ends when\n (1) you or the creature you are challenging falls unconscious or drops to 0 hp.\n (2) you hit a different enemy with an attack (assuming you hit with the –4 penalty).\n (3) the creature flees far away and you choose to end the challenge.",
      "Adventurer": "The attack and disengage penalty for challenged enemies (but not for you) is equal to –4 or to the escalation die, whichever is higher.",
      "Champion": "You can have two challenges active at the same time against different enemies.",
      "Epic": "Enemies you challenge are vulnerable to your attacks."
    },
    "Path of Universal Righteous Endeavor": {
      "Type": "Optional",
      "Exclusive": "Way of Evil Bastards",
      "Base": "Your nearby allies gain a +1 bonus to all saves.",
      "Adventurer": "Once per day, you can reroll your relationship dice with a heroic or ambiguous icon.",
      "Champion": "All of your melee and ranged attacks deal holy damage.",
      "Epic": "You gain an additional relationship point with a heroic or ambiguous icon."
    },
    "Way of Evil Bastards": {
      "Type": "Optional",
      "Exclusive": "Path of Universal Righteous Endeavor",
      "Base": "When one of your Smite Evil attacks drops a non-mook enemy to 0 hp, that use of Smite Evil is not expended.",
      "Adventurer": "Once per day, you can reroll your relationship dice with a villainous or ambiguous icon.",
      "Champion": "When one of your Smite Evil attacks drops three or more mooks, it is not expended.",
      "Epic": "You gain an additional relationship point with a villainous or ambiguous icon."
    }
  }
}
