{
  "Talents": {
    "Extra Tough": {
      "Type": "Default",
      "Effect": "You start with nine recoveries instead of the usual eight.",
      "Adventurer": "Increase your total recoveries by 1."
    },
    "Threatening": {
      "Type": "Default",
      "Effect": "Whenever an enemy attempts to disengage from you, it takes a penalty to its check equal to your Dexterity or Constitution modifier, whichever is higher. The penalty doesn’t apply if you are stunned, grabbed, or otherwise incapable of making an opportunity attack.",
      "Adventurer": "Whenever an enemy fails to disengage from you, you also deal damage to that enemy equal to your Dexterity or Constitution modifier. At 5th level, damage is double the modifier. At 8th level, it’s triple.",
      "Champion": "Whenever a non-mook enemy fails to disengage from you, it’s vulnerable to your attacks for the rest of the battle."
    },
    "Cleave": {
      "Type": "Optional",
      "Effect": "Once per battle, make a fighter melee attack as a free action after one of your melee attacks drops an enemy to 0 hp.",
      "Adventurer": "If you have your move action available, you can use it before making your Cleave attack to reach an enemy you are not already engaged with.",
      "Champion": "You can use Cleave twice each battle, but only once a round.",
      "Epic": "You gain a +4 attack bonus with your Cleave attacks."
    },
    "Comeback Strike": {
      "Type": "Optional",
      "Effect": "Once per battle as a free action, make another attack with a –2 penalty after your first fighter attack during your turn misses.",
      "Adventurer": "You no longer take the –2 penalty to your Comeback Strike attacks.",
      "Champion": "Once per day, you can use Comeback Strike twice in a battle.",
      "Epic": "You gain a +4 attack bonus with your Comeback Strike attacks."
    },
    "Counter-Attack": {
      "Type": "Optional",
      "Effect": "Once per round when the escalation die is even and an enemy misses you with a natural odd melee attack roll, you can make a basic melee attack dealing half damage against that enemy as a free action. (The attack can’t use any limited abilities or flexible attack maneuvers.)",
      "Adventurer": "Your Counter-Attack attack now deals full damage.",
      "Champion": "You can use Counter-Attack once per turn instead of once per round (in effect, you’re free to Counter-Attack once per enemy turn).",
      "Epic": "You can now use Counter-Attack when the escalation die is 3+."
    },
    "Deadeye Archer": {
      "Type": "Optional",
      "Effect": "Your attacks with d8 ranged weapons (heavy crossbow, longbow) now deal d10 damage per level. Your attacks with d6 ranged weapons (light crossbow, shortbow) now deal d8 damage per level. In addition, your misses with basic ranged attacks deal damage equal to your level.",
      "Adventurer": "If you spend a quick action to aim before making a ranged basic attack, add your Dexterity modifier to the damage if you miss.",
      "Champion": "Once per battle, expand your crit range with a fighter ranged attack by 4 (usually to 16+) for that attack. Declare you’re using this feat power before you roll the attack.",
      "Epic": "Your crit range with ranged weapon attacks expands by 1 (usually to 19+)."
    },
    "Heavy Warrior": {
      "Type": "Optional",
      "Effect": "Once per battle while wearing heavy armor, when you are hit by an attack that targets AC, as a free action, you can take half damage from that attack instead.",
      "Adventurer": "Once per day, you can use Heavy Warrior twice in a battle (against different attacks).",
      "Champion": "You can also use the power against an attack that targets PD.",
      "Epic": "Once per day, you can reroll a recharge roll for a magic armor power."
    },
    "Power Attack": {
      "Type": "Optional",
      "Effect": "Once per battle before you roll an attack, you can declare you’re using Power Attack to deal additional damage with that attack roll. If the attack hits, you deal the following additional damage: Deal 1d4 additional damage per level if you are using a one-handed weapon. Deal 1d6 additional damage per level if you are using a two-handed weapon.",
      "Adventurer": "You deal the additional Power Attack damage even if the attack misses.",
      "Champion": "One battle per day, you can use Power Attack twice in the battle.",
      "Epic": "One-handed weapon damage using Power Attack increases to 1d6 per level; two-handed weapon damage using Power Attack increases to 1d8 per level."
    },
    "Skilled Intercept": {
      "Type": "Optional",
      "Effect": "Once per round as a free action, roll a normal save (11+) to intercept an enemy who is moving to attack one of your nearby allies. You can pop free from one enemy to move and intercept the attack. If you are engaged with more than one enemy, the others can take opportunity attacks against you. The moving enemy makes its attack with you as a target instead. If you’re wearing heavy armor and the attack hits, you only take half damage.",
      "Adventurer": "You can pop free from up to two enemies when using Skilled Intercept.",
      "Champion": "You gain a bonus to your Skilled Intercept save equal to the escalation die.",
      "Epic": "Enemies can’t make opportunity attacks against you during your Skilled Intercept movement."
    },
    "Tough as Iron": {
      "Type": "Optional",
      "Effect": "Once per battle, you can rally using a quick action instead of a standard action.",
      "Adventurer": "Once per day, you can rally twice during a battle as a quick action, without needing to roll a save for the second rally.",
      "Champion": "Increase your total number of recoveries by 2.",
      "Epic": "When you roll a natural 20 with an attack, you gain an additional use of Tough As Iron this battle."
    }
  },
  "Bonus": {
    "Name": "Manuevers",
    "Level 1": {
      "Brace for It": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Any miss",
        "Effect": "Until the end of your next turn, the first critical hit you take from a melee attack becomes a normal hit instead.",
        "Adventurer": "Brace for it now works against a critical hit from any type of attack.",
        "Champion": "Brace for it works against any number of critical hits before your next turn."
      },
      "Carve an Opening": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Any natural odd roll",
        "Effect": "Your crit range with melee attacks expands by a cumulative +1 this battle until you score a melee critical hit. When you score a melee critical hit, your crit range drops back to normal.",
        "Champion": "The crit range bonus from carve an opening is +2 instead of +1."
      },
      "Deadly Assault": {
        "Type": "Flexible melee or ranged attack",
        "Triggering Roll": "Any natural even hit",
        "Effect": "Reroll any 1s from your damage roll. You’re stuck with the rerolls.",
        "Adventurer": "Now you can reroll both 1s and 2s with deadly assault.",
        "Champion": "Deadly assault now also triggers on a natural 17+."
      },
      "Defensive Fighting": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Natural 16+; if you fight with a shield, also any natural even roll",
        "Effect": "Gain a +2 bonus to AC until the end of your next turn.",
        "Adventurer": "You also gain the bonus to Physical Defense.",
        "Champion": "The bonus increases to +3.",
        "Epic": "You also gain the bonus to Mental Defense."
      },
      "Grim Intent": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Any natural even miss",
        "Effect": "The next time you would deal miss damage with a melee attack, add a WEAPON die to that damage. At 5th level, instead add 2 total WEAPON dice; at 8th level, instead add 3 total WEAPON dice."
      },
      "Heavy Blows": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Any natural even miss",
        "Effect": "You gain a bonus to your miss damage with that attack equal to the escalation die.",
        "Champion": "If you attacked with a two-handed weapon, heavy blows can trigger on any miss, odd or even.",
        "Epic": "The bonus instead equals double the escalation die with a one-handed weapon, or triple it with a two-handed weapon."
      },
      "Precision Attack": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Any hit with a natural 16+",
        "Effect": "You gain a bonus to the damage roll equal to your Dexterity modifier. At 5th level, the damage bonus increases to double your Dexterity modifier; at 8th level the damage bonus increases to triple it.",
        "Adventurer": "You can now use precision attack with a ranged attack."
      },
      "Second Shot": {
        "Type": "Flexible ranged attack",
        "Triggering Roll": "Natural 16+",
        "Effect": "After this attack, you can make a basic ranged attack with the same weapon (as long as it’s not a weapon that takes a quick action to reload or draw) with a –4 attack penalty. You can’t use any maneuvers with the second attack.",
        "Champion": "The second shot attack penalty is –2 instead."
      },
      "Shield Bash": {
        "Type": "Flexible melee attack",
        "Special": "You must be using a shield.",
        "Triggering Roll": "Any natural even roll",
        "Effect": "The target pops free from you after the attack (does not allow opportunity attacks).",
        "Adventurer": "If the target is also engaged with any of your allies, you can have it pop free from them as well.",
        "Champion": "Once per battle, you can also daze the target (save ends) of your shield bash attack, if that enemy is staggered."
      },
      "Two-Weapon Pressure": {
        "Type": "Flexible melee attack",
        "Special": "You must be using a weapon in each hand.",
        "Triggering Roll": "Any miss",
        "Effect": "Until the end of your next turn, you gain a +2 melee attack bonus against the target.",
        "Champion": "The bonus increases to +4."
      }
    },
    "Level 3": {
      "Hack & Slash": {
        "Type": "Flexible melee attack",
        "Special": "You can use this maneuver only once per round.",
        "Triggering Roll": "Any natural even roll, when the escalation die is 2+",
        "Effect": "Make another melee weapon attack against a different target."
      },
      "Make ’em Flinch": {
        "Type": "Flexible ranged attack",
        "Triggering Roll": "Any natural even miss",
        "Effect": "Add the higher modifier from your Strength or Dexterity to the miss damage. At 5th level the damage bonus increases to double your chosen modifier; at 8th level the damage bonus increases to triple it."
      },
      "Punish Them": {
        "Type": "Flexible melee attack",
        "Special": "You can use this maneuver only when you make an opportunity attack.",
        "Triggering Roll": "Any hit with a natural 16+",
        "Effect": "The target is dazed until the end of its turn.",
        "Adventurer": "If the target was moving, it stops moving and loses the rest of its move action.",
        "Champion": "The dazed effect is now save ends.",
        "Epic": "The target is now weakened (save ends) instead of dazed."
      },
      "Steady Now": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Any natural even miss",
        "Effect": "You gain temporary hit points equal to your Constitution modifier.",
        "Champion": "The temporary hit points increase to double your Constitution modifier."
      },
      "Strong Guard": {
        "Type": "Flexible melee attack",
        "Special": "You must be using a shield.",
        "Triggering Roll": "Any miss",
        "Effect": "One ally next to you (including an ally engaged with the same enemy as you) gains a +2 AC bonus until the start of your next turn or until you are no longer next to them.",
        "Champion": "Bonus also applies to PD.",
        "Epic": "Bonus increases to +3."
      }
    },
    "Level 5": {
      "A Dozen Cuts": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Any natural even hit",
        "Effect": "The target also takes ongoing damage equal to double your Dexterity modifier, or triple it at 8th level.",
        "Champion": "Once per battle, you can trigger a dozen cuts with a natural odd hit."
      },
      "Hero’s Skill": {
        "Type": "Flexible melee or ranged attack",
        "Triggering Roll": "Any natural even miss",
        "Effect": "Add +2 to the attack roll, then halve any damage dealt by the attack if it hits.",
        "Champion": "Add +4 to the attack roll instead of +2.",
        "Epic": "The damage is no longer halved on a hit after using hero’s skill."
      },
      "Sword Master’s Anticipation": {
        "Type": "Flexible melee attack",
        "Special": "You must have the Skilled Intercept talent to use this maneuver.",
        "Triggering Roll": "Any natural even roll",
        "Effect": "The next time you use Skilled Intercept this battle, your Skilled Intercept save automatically succeeds."
      }
    },
    "Level 7": {
      "Never Surrender": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Any natural even roll",
        "Effect": "You can roll a save against a save ends effect.",
        "Epic": "You gain a +2 bonus to the save."
      },
      "Spinning Charge": {
        "Type": "Flexible melee attack",
        "Special": "You must have moved before the attack.",
        "Triggering Roll": "Any natural even hit",
        "Effect": "After dealing damage, you can pop free from the target, move to a different nearby enemy, and make a basic melee attack against that enemy. You can’t use any maneuvers with the second attack, and it deals only half damage.",
        "Epic": "If the escalation die is 3+, the second spinning charge attack deals full damage."
      },
      "Sword of Destiny": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Natural 20",
        "Effect": "You can heal using a free recovery.",
        "Epic": "If the escalation die is 3+, you can now trigger sword of destiny with a natural 18+."
      }
    },
    "Level 9": {
      "Combat Mastery": {
        "Type": "Flexible melee attack",
        "Special": "You can use this maneuver only once per battle.",
        "Triggering Roll": "Natural 16+",
        "Effect": "Increase the escalation die by 1.",
        "Epic": "Combat mastery now also triggers on any natural even hit."
      },
      "Set ’em Up": {
        "Type": "Flexible melee attack",
        "Triggering Roll": "Any hit with a natural 16+",
        "Effect": "The crit range of your attacks against the target expands by 3 (generally 17+) until the end of the battle (cumulative).",
        "Epic": "The crit range bonus from set ’em up now also applies to any ally who attacks the target while you are engaged with it."
      }
    }
  }
}
